In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.3.3'

# creating series

In [4]:
s = pd.Series([1,2,3,4])

In [5]:
s

0    1
1    2
2    3
3    4
dtype: int64

# creating dataframe

In [6]:
df = pd.DataFrame(
    {
        "Name": ["Ali", "Reza", "Mina", "Sara", "Hassan"],
        "Age": [23,24,35,45,66],
        "City": ["Tehran", "Mahhad", "Shiraz", "Isfehan", "Birjand"]
    }
)

In [7]:
df

     Name  Age     City
0     Ali   23   Tehran
1    Reza   24   Mahhad
2    Mina   35   Shiraz
3    Sara   45  Isfehan
4  Hassan   66  Birjand

In [8]:
df["Name"]

0       Ali
1      Reza
2      Mina
3      Sara
4    Hassan
Name: Name, dtype: object

In [10]:
df.iloc[0]

Name       Ali
Age         23
City    Tehran
Name: 0, dtype: object